{"example_id": "FamilyOWL_1hop__g129__q1__1hop-Thing_m164_m164-m164-rdf:type-Ancestor-NEG-BIN__Is the individual identified as \"m164\" considered an ancestor?", "split": "train", "question": "Is the individual identified as \"m164\" considered an ancestor?", "sparql_query": "", "reference_sparql_query": "ASK WHERE { <http://www.example.com/genealogy.owl#m164> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.example.com/genealogy.owl#Ancestor> }", "task_type": "Membership", "answer_type": "BIN", "answer": "FALSE", "source_name": "FamilyOWL_1hop", "group_index": 129, "qa_index": 1, "gold_explanations": [], "gold_units": [], "answer_context_units": ["Ancestor disjointWith Marriage", "Ancestor disjointWith Sex", "InverseObjectProperties(hasAncestor,isAncestorOf)", "SubObjectPropertyOf(hasAncestor,hasRelation)", "SubObjectPropertyOf(hasAncestor,topObjectProperty)", "SubObjectPropertyOf(hasParent,hasAncestor)", "TransitiveObjectProperty(hasAncestor)", "alsoKnownAs rdf:type AnnotationProperty", "formerlyKnownAs rdf:type AnnotationProperty", "knownAs rdf:type AnnotationProperty", "m164 hasFemalePartner ann_lodge_1763", "m164 hasMalePartner james_dickens_1774", "EquivalentObjectProperties(hasParent,isChildOf)", "InverseObjectProperties(hasFemalePartner,isFemalePartnerIn)", "InverseObjectProperties(hasMalePartner,isMalePartnerIn)", "InverseObjectProperties(hasParent,isParentOf)", "SubObjectPropertyOf(hasFather,hasParent)", "SubObjectPropertyOf(hasFemalePartner,hasPartner)", "SubObjectPropertyOf(hasMalePartner,hasPartner)", "SubObjectPropertyOf(hasMother,hasParent)", "SubObjectPropertyOf(isBloodrelationOf,hasRelation)", "SubObjectPropertyOf(isBloodrelationOf,topObjectProperty)", "SymmetricObjectProperty(hasRelation)", "hasParent domain Person", "hasParent range Person", "hasRelation domain Person", "hasRelation range Person", "Marriage disjointWith Person", "Person disjointWith Sex", "hasPartner range Person", "hasFather domain Person", "hasMother domain Person", "Person subClassOf DomainEntity", "hasSex domain Person", "isBrotherOf range Person", "isSisterOf range Person", "isUncleOf range Person", "hasFemalePartner domain Marriage", "hasMalePartner domain Marriage", "hasPartner domain Marriage"], "evaluation_scope": "answer_only", "has_gold_support": false}
{"example_id": "FamilyOWL_1hop__g154__q1__1hop-Thing_mary_tacey_1808_mary_tacey_1808-mary_tacey_1808-rdf:type-Ancestor-NEG-BIN__Is Mary Tacey considered an ancestor?", "split": "train", "question": "Is Mary Tacey considered an ancestor?", "sparql_query": "", "reference_sparql_query": "ASK WHERE { <http://www.example.com/genealogy.owl#mary_tacey_1808> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://www.example.com/genealogy.owl#Ancestor> }", "task_type": "Membership", "answer_type": "BIN", "answer": "FALSE", "source_name": "FamilyOWL_1hop", "group_index": 154, "qa_index": 1, "gold_explanations": [], "gold_units": [], "answer_context_units": ["mary_bainton_1780 isMotherOf mary_tacey_1808", "mary_tacey_1808 hasBrother thomas_tacey_1806", "mary_tacey_1808 hasBrother william_tacey_1818", "mary_tacey_1808 hasSister mary_tacey_1809", "mary_tacey_1808 hasSister mary_tacey_1811", "mary_tacey_1809 hasSister mary_tacey_1808", "william_tacey_1783 isFatherOf mary_tacey_1808", "Ancestor disjointWith Marriage", "Ancestor disjointWith Sex", "InverseObjectProperties(hasAncestor,isAncestorOf)", "SubObjectPropertyOf(hasAncestor,hasRelation)", "SubObjectPropertyOf(hasAncestor,topObjectProperty)", "SubObjectPropertyOf(hasParent,hasAncestor)", "TransitiveObjectProperty(hasAncestor)", "EquivalentObjectProperties(hasParent,isChildOf)", "InverseObjectProperties(hasBrother,isBrotherOf)", "InverseObjectProperties(hasFather,isFatherOf)", "InverseObjectProperties(hasMother,isMotherOf)", "InverseObjectProperties(hasParent,isParentOf)", "InverseObjectProperties(hasSister,isSisterOf)", "SubObjectPropertyOf(hasFather,hasParent)", "SubObjectPropertyOf(hasMother,hasParent)", "SubObjectPropertyOf(isBloodrelationOf,hasRelation)", "SubObjectPropertyOf(isBloodrelationOf,topObjectProperty)", "SubObjectPropertyOf(isFatherOf,isParentOf)", "SubObjectPropertyOf(isMotherOf,isParentOf)", "SymmetricObjectProperty(hasRelation)", "hasParent domain Person", "hasParent range Person", "hasRelation domain Person", "hasRelation range Person", "Marriage disjointWith Person", "Person disjointWith Sex", "hasFather domain Person", "hasMother domain Person", "isBrotherOf range Person", "isSisterOf range Person", "Person subClassOf DomainEntity", "hasPartner range Person", "hasSex domain Person"], "evaluation_scope": "answer_only", "has_gold_support": false}
{"example_id": "FamilyOWL_1hop__g378__q1__1hop-Thing_clarence_john_heath_1896_clarence_john_heath_1896-clarence_john_heath_1896-isBrotherOf-ada_rachel_heath_1868-NEG-BIN__Is Clarence John Heath a brother of Ada Rachel Heath?", "split": "train", "question": "Is Clarence John Heath a brother of Ada Rachel Heath?", "sparql_query": "", "reference_sparql_query": "ASK WHERE { <http://www.example.com/genealogy.owl#clarence_john_heath_1896> <http://www.example.com/genealogy.owl#isBrotherOf> <http://www.example.com/genealogy.owl#ada_rachel_heath_1868> }", "task_type": "Property Assertion", "answer_type": "BIN", "answer": "FALSE", "source_name": "FamilyOWL_1hop", "group_index": 378, "qa_index": 1, "gold_explanations": [], "gold_units": [], "answer_context_units": ["florelle_nenuphar_heath_1880 hasBrother clarence_john_heath_1896", "harriet_whitefield_1861 isMotherOf clarence_john_heath_1896", "william_lock_jacobs_1861 isFatherOf clarence_john_heath_1896", "InverseObjectProperties(hasBrother,isBrotherOf)", "SubObjectPropertyOf(isBrotherOf,isSiblingOf)", "hasBrother propertyDisjointWith isChildOf", "isBrotherOf domain Man", "isBrotherOf range Person", "InverseObjectProperties(hasFather,isFatherOf)", "InverseObjectProperties(hasMother,isMotherOf)", "SubObjectPropertyOf(isFatherOf,isParentOf)", "SubObjectPropertyOf(isMotherOf,isParentOf)", "SubObjectPropertyOf(isSiblingOf,isBloodrelationOf)", "SubObjectPropertyOf(isSisterOf,isSiblingOf)", "SymmetricObjectProperty(isSiblingOf)", "TransitiveObjectProperty(isSiblingOf)", "InverseObjectProperties(hasParent,isParentOf)", "SubObjectPropertyOf(hasFather,hasParent)", "SubObjectPropertyOf(hasMother,hasParent)", "hasParent domain Person", "hasParent range Person", "EquivalentObjectProperties(hasParent,isChildOf)", "SubObjectPropertyOf(hasParent,hasAncestor)", "hasFather domain Person", "hasMother domain Person", "isSisterOf range Person", "Marriage disjointWith Person", "Person disjointWith Sex", "Person subClassOf DomainEntity", "hasPartner range Person", "hasRelation domain Person", "hasRelation range Person", "hasSex domain Person", "isUncleOf range Person", "hasFather range Man", "FunctionalObjectProperty(hasFather)", "Man disjointWith Marriage", "Man disjointWith Woman", "isUncleOf domain Man", "hasHusband range Man"], "evaluation_scope": "answer_only", "has_gold_support": false}
{"example_id": "FamilyOWL_1hop__g441__q0__1hop-Thing_george_whitfield_1865_george_whitfield_1865-george_whitfield_1865-hasMother-ada_rachel_heath_1868-NEG-BIN__Is George Whitfield's mother Ada Rachel Heath?", "split": "train", "question": "Is George Whitfield's mother Ada Rachel Heath?", "sparql_query": "", "reference_sparql_query": "ASK WHERE { <http://www.example.com/genealogy.owl#george_whitfield_1865> <http://www.example.com/genealogy.owl#hasMother> <http://www.example.com/genealogy.owl#ada_rachel_heath_1868> }", "task_type": "Property Assertion", "answer_type": "BIN", "answer": "FALSE", "source_name": "FamilyOWL_1hop", "group_index": 441, "qa_index": 0, "gold_explanations": [], "gold_units": [], "answer_context_units": ["harriet_ann_young_1825 isMotherOf george_whitfield_1865", "harriet_whitefield_1861 hasBrother george_whitfield_1865", "james_whitfield_1821 isFatherOf george_whitfield_1865", "james_whitfield_1848 hasBrother george_whitfield_1865", "FunctionalObjectProperty(hasMother)", "InverseObjectProperties(hasMother,isMotherOf)", "SubObjectPropertyOf(hasMother,hasParent)", "SubObjectPropertyOf(isMotherOf,isParentOf)", "hasMother domain Person", "hasMother range Woman", "EquivalentObjectProperties(hasParent,isChildOf)", "InverseObjectProperties(hasBrother,isBrotherOf)", "InverseObjectProperties(hasFather,isFatherOf)", "InverseObjectProperties(hasParent,isParentOf)", "SubObjectPropertyOf(hasFather,hasParent)", "SubObjectPropertyOf(hasParent,hasAncestor)", "SubObjectPropertyOf(isFatherOf,isParentOf)", "hasParent domain Person", "hasParent range Person", "hasFather domain Person", "isBrotherOf range Person", "Marriage disjointWith Person", "Person disjointWith Sex", "Person subClassOf DomainEntity", "hasPartner range Person", "hasRelation domain Person", "hasRelation range Person", "hasSex domain Person", "isSisterOf range Person", "isUncleOf range Person", "FunctionalObjectProperty(hasFather)", "hasFather range Man", "Man disjointWith Woman", "Man disjointWith Marriage", "Marriage disjointWith Woman", "Ancestor disjointWith Marriage", "Ancestor disjointWith Sex", "Female disjointWith Male", "Marriage disjointWith Sex", "Marriage subClassOf DomainEntity"], "evaluation_scope": "answer_only", "has_gold_support": false}
{"example_id": "FamilyOWL_1hop__g484__q1__1hop-Thing_james_hewett_1815_james_hewett_1815-james_hewett_1815-isParentOf-ada_rachel_heath_1868-NEG-BIN__Is James Hewett the parent of Ada Rachel Heath?", "split": "train", "question": "Is James Hewett the parent of Ada Rachel Heath?", "sparql_query": "", "reference_sparql_query": "ASK WHERE { <http://www.example.com/genealogy.owl#james_hewett_1815> <http://www.example.com/genealogy.owl#isParentOf> <http://www.example.com/genealogy.owl#ada_rachel_heath_1868> }", "task_type": "Property Assertion", "answer_type": "BIN", "answer": "FALSE", "source_name": "FamilyOWL_1hop", "group_index": 484, "qa_index": 1, "gold_explanations": [], "gold_units": [], "answer_context_units": ["james_hewett_1815 isFatherOf charlotte_hewett_1863", "james_hewett_1815 isFatherOf elisa_amelia_hewett_1858", "james_hewett_1815 isFatherOf emma_hewett_1860", "james_hewett_1815 isFatherOf james_hewett_1850", "james_hewett_1815 isFatherOf jane_hewett_1849", "james_hewett_1815 isFatherOf john_james_hewett_1845", "james_hewett_1815 isFatherOf mary_ann_hewett_1852", "james_hewett_1815 isFatherOf rosena_martha_hewett_1847", "m172 hasMalePartner james_hewett_1815", "EquivalentObjectProperties(hasParent,isChildOf)", "InverseObjectProperties(hasParent,isParentOf)", "SubObjectPropertyOf(hasFather,hasParent)", "SubObjectPropertyOf(hasMother,hasParent)", "SubObjectPropertyOf(hasParent,hasAncestor)", "SubObjectPropertyOf(isFatherOf,isParentOf)", "SubObjectPropertyOf(isMotherOf,isParentOf)", "hasParent domain Person", "hasParent range Person", "FunctionalObjectProperty(hasFather)", "FunctionalObjectProperty(hasMother)", "InverseObjectProperties(hasAncestor,isAncestorOf)", "InverseObjectProperties(hasChild,isChildOf)", "InverseObjectProperties(hasFather,isFatherOf)", "InverseObjectProperties(hasMalePartner,isMalePartnerIn)", "InverseObjectProperties(hasMother,isMotherOf)", "SubObjectPropertyOf(hasAncestor,hasRelation)", "SubObjectPropertyOf(hasAncestor,topObjectProperty)", "SubObjectPropertyOf(hasMalePartner,hasPartner)", "SubObjectPropertyOf(isDaughterOf,isChildOf)", "SubObjectPropertyOf(isSonOf,isChildOf)", "TransitiveObjectProperty(hasAncestor)", "hasFather domain Person", "hasMother domain Person", "hasPartner range Person", "hasRelation domain Person", "hasRelation range Person", "Marriage disjointWith Person", "Person disjointWith Sex", "Person subClassOf DomainEntity", "hasSex domain Person"], "evaluation_scope": "answer_only", "has_gold_support": false}
{"example_id": "FamilyOWL_1hop__g542__q1__1hop-Thing_laura_templar_1994_laura_templar_1994-laura_templar_1994-isSiblingOf-ada_rachel_heath_1868-NEG-BIN__Is Laura Templar a sibling of Ada Rachel Heath?", "split": "train", "question": "Is Laura Templar a sibling of Ada Rachel Heath?", "sparql_query": "", "reference_sparql_query": "ASK WHERE { <http://www.example.com/genealogy.owl#laura_templar_1994> <http://www.example.com/genealogy.owl#isSiblingOf> <http://www.example.com/genealogy.owl#ada_rachel_heath_1868> }", "task_type": "Property Assertion", "answer_type": "BIN", "answer": "FALSE", "source_name": "FamilyOWL_1hop", "group_index": 542, "qa_index": 1, "gold_explanations": [], "gold_units": [], "answer_context_units": ["laura_templar_1994 hasFather peter_templar_1962", "laura_templar_1994 isSisterOf emma_templar_1991", "SubObjectPropertyOf(isBrotherOf,isSiblingOf)", "SubObjectPropertyOf(isSiblingOf,isBloodrelationOf)", "SubObjectPropertyOf(isSisterOf,isSiblingOf)", "SymmetricObjectProperty(isSiblingOf)", "TransitiveObjectProperty(isSiblingOf)", "FunctionalObjectProperty(hasFather)", "InverseObjectProperties(hasBrother,isBrotherOf)", "InverseObjectProperties(hasFather,isFatherOf)", "InverseObjectProperties(hasSister,isSisterOf)", "SubObjectPropertyOf(hasFather,hasParent)", "SubObjectPropertyOf(isBloodrelationOf,hasRelation)", "SubObjectPropertyOf(isBloodrelationOf,topObjectProperty)", "hasFather domain Person", "hasFather range Man", "isSisterOf range Person", "isBrotherOf range Person", "hasParent domain Person", "hasParent range Person", "hasRelation domain Person", "hasRelation range Person", "Marriage disjointWith Person", "Person disjointWith Sex", "Person subClassOf DomainEntity", "hasMother domain Person", "hasPartner range Person", "hasSex domain Person", "isUncleOf range Person", "SubObjectPropertyOf(hasMother,hasParent)", "EquivalentObjectProperties(hasParent,isChildOf)", "InverseObjectProperties(hasParent,isParentOf)", "SubObjectPropertyOf(hasParent,hasAncestor)", "SubObjectPropertyOf(hasAncestor,hasRelation)", "SymmetricObjectProperty(hasRelation)", "isBrotherOf domain Man", "Man disjointWith Marriage", "Man disjointWith Woman", "isSisterOf domain Woman", "Marriage disjointWith Woman"], "evaluation_scope": "answer_only", "has_gold_support": false}
{"example_id": "FamilyOWL_1hop__g580__q0__1hop-Thing_m151_m151-m151-hasMalePartner-ada_rachel_heath_1868-NEG-BIN__Is the person identified as m151 in a male partnership with Ada Rachel Heath?", "split": "train", "question": "Is the person identified as m151 in a male partnership with Ada Rachel Heath?", "sparql_query": "", "reference_sparql_query": "ASK WHERE { <http://www.example.com/genealogy.owl#m151> <http://www.example.com/genealogy.owl#hasMalePartner> <http://www.example.com/genealogy.owl#ada_rachel_heath_1868> }", "task_type": "Property Assertion", "answer_type": "BIN", "answer": "FALSE", "source_name": "FamilyOWL_1hop", "group_index": 580, "qa_index": 0, "gold_explanations": [], "gold_units": [], "answer_context_units": ["Female disjointWith Male", "Marriage disjointWith Person", "Person disjointWith Sex", "m151 hasMalePartner henry_edmund_bright_1862", "Ancestor disjointWith Marriage", "Ancestor disjointWith Sex", "InverseObjectProperties(hasMalePartner,isMalePartnerIn)", "Male subClassOf Sex", "Man disjointWith Marriage", "Man disjointWith Woman", "Marriage disjointWith Sex", "Marriage disjointWith Woman", "Person subClassOf DomainEntity", "SubObjectPropertyOf(hasMalePartner,hasPartner)", "alsoKnownAs rdf:type AnnotationProperty", "formerlyKnownAs rdf:type AnnotationProperty", "hasBrother propertyDisjointWith isChildOf", "hasFather domain Person", "hasMalePartner domain Marriage", "hasMalePartner range Man", "FunctionalObjectProperty(hasFather)", "InverseObjectProperties(hasFather,isFatherOf)", "InverseObjectProperties(hasPartner,isPartnerIn)", "SubObjectPropertyOf(hasFather,hasParent)", "SubObjectPropertyOf(hasFemalePartner,hasPartner)", "hasPartner domain Marriage", "Marriage subClassOf DomainEntity", "hasFemalePartner domain Marriage", "hasPartner range Person", "Female subClassOf Sex", "Sex subClassOf DomainEntity", "hasFather range Man", "hasParent domain Person", "hasParent range Person", "hasMother domain Person", "hasRelation domain Person", "hasRelation range Person", "hasSex domain Person", "isBrotherOf range Person", "isSisterOf range Person"], "evaluation_scope": "answer_only", "has_gold_support": false}
{"example_id": "FamilyOWL_1hop__g580__q1__1hop-Thing_m151_m151-m151-hasPartner-ada_rachel_heath_1868-NEG-BIN__Is the person identified as m151 a partner of Ada Rachel Heath?", "split": "train", "question": "Is the person identified as m151 a partner of Ada Rachel Heath?", "sparql_query": "", "reference_sparql_query": "ASK WHERE { <http://www.example.com/genealogy.owl#m151> <http://www.example.com/genealogy.owl#hasPartner> <http://www.example.com/genealogy.owl#ada_rachel_heath_1868> }", "task_type": "Property Assertion", "answer_type": "BIN", "answer": "FALSE", "source_name": "FamilyOWL_1hop", "group_index": 580, "qa_index": 1, "gold_explanations": [], "gold_units": [], "answer_context_units": ["hasPartner range Person", "m151 hasFemalePartner charlotte_hewett_1863", "m151 hasMalePartner henry_edmund_bright_1862", "InverseObjectProperties(hasFemalePartner,isFemalePartnerIn)", "InverseObjectProperties(hasMalePartner,isMalePartnerIn)", "InverseObjectProperties(hasPartner,isPartnerIn)", "Marriage disjointWith Person", "Person disjointWith Sex", "Person subClassOf DomainEntity", "SubObjectPropertyOf(hasFemalePartner,hasPartner)", "SubObjectPropertyOf(hasMalePartner,hasPartner)", "alsoKnownAs rdf:type AnnotationProperty", "formerlyKnownAs rdf:type AnnotationProperty", "hasFather domain Person", "hasFemalePartner domain Marriage", "hasFemalePartner range Woman", "hasMalePartner domain Marriage", "hasMalePartner range Man", "hasMother domain Person", "hasParent domain Person", "EquivalentObjectProperties(hasParent,isChildOf)", "FunctionalObjectProperty(hasFather)", "FunctionalObjectProperty(hasMother)", "InverseObjectProperties(hasFather,isFatherOf)", "InverseObjectProperties(hasMother,isMotherOf)", "InverseObjectProperties(hasParent,isParentOf)", "SubObjectPropertyOf(hasFather,hasParent)", "SubObjectPropertyOf(hasMother,hasParent)", "SubObjectPropertyOf(hasParent,hasAncestor)", "hasParent range Person", "hasRelation domain Person", "hasRelation range Person", "hasSex domain Person", "isBrotherOf range Person", "isSisterOf range Person", "isUncleOf range Person", "hasPartner domain Marriage", "Man disjointWith Marriage", "Marriage disjointWith Woman", "Ancestor disjointWith Marriage"], "evaluation_scope": "answer_only", "has_gold_support": false}
{"example_id": "FamilyOWL_1hop__g580__q3__1hop-Thing_m151_m151-m151-hasFemalePartner-ada_rachel_heath_1868-NEG-BIN__Is the person identified as m151 in a relationship with Ada Rachel Heath?", "split": "train", "question": "Is the person identified as m151 in a relationship with Ada Rachel Heath?", "sparql_query": "", "reference_sparql_query": "ASK WHERE { <http://www.example.com/genealogy.owl#m151> <http://www.example.com/genealogy.owl#hasFemalePartner> <http://www.example.com/genealogy.owl#ada_rachel_heath_1868> }", "task_type": "Property Assertion", "answer_type": "BIN", "answer": "FALSE", "source_name": "FamilyOWL_1hop", "group_index": 580, "qa_index": 3, "gold_explanations": [], "gold_units": [], "answer_context_units": ["Marriage disjointWith Person", "Person disjointWith Sex", "Ancestor disjointWith Marriage", "Ancestor disjointWith Sex", "Female disjointWith Male", "Man disjointWith Marriage", "Man disjointWith Woman", "Marriage disjointWith Sex", "Marriage disjointWith Woman", "Person subClassOf DomainEntity", "alsoKnownAs rdf:type AnnotationProperty", "formerlyKnownAs rdf:type AnnotationProperty", "hasBrother propertyDisjointWith isChildOf", "hasFather domain Person", "hasMother domain Person", "hasParent domain Person", "hasParent range Person", "hasPartner range Person", "hasRelation domain Person", "hasRelation range Person", "EquivalentObjectProperties(hasParent,isChildOf)", "FunctionalObjectProperty(hasFather)", "FunctionalObjectProperty(hasMother)", "InverseObjectProperties(hasFather,isFatherOf)", "InverseObjectProperties(hasMother,isMotherOf)", "InverseObjectProperties(hasParent,isParentOf)", "InverseObjectProperties(hasPartner,isPartnerIn)", "SubObjectPropertyOf(hasAncestor,hasRelation)", "SubObjectPropertyOf(hasFather,hasParent)", "SubObjectPropertyOf(hasFemalePartner,hasPartner)", "SubObjectPropertyOf(hasMalePartner,hasPartner)", "SubObjectPropertyOf(hasMother,hasParent)", "SubObjectPropertyOf(hasParent,hasAncestor)", "SubObjectPropertyOf(isBloodrelationOf,hasRelation)", "SymmetricObjectProperty(hasRelation)", "hasSex domain Person", "isBrotherOf range Person", "isSisterOf range Person", "isUncleOf range Person", "hasPartner domain Marriage"], "evaluation_scope": "answer_only", "has_gold_support": false}
